kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <WebSocketsServer.h>
#include <Hash.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#if WIFI_MANAGER
#include <WiFiManager.h>
#endif /* WIFI_MANAGER */
#include <ESP8266HTTPUpdateServer.h>

#include "main.h"
#include "stm32Updater.h"
#include "stk500.h"
#include "msp.h"
#include "common_defs.h"

#ifdef ESP_NOW
#ifndef ESP_NOW_PEERS
#undef ESP_NOW
#endif // ESP_NOW_PEERS
#endif // ESP_NOW

#ifndef SERIAL_BAUD
#define SERIAL_BAUD 460800
#endif

#define STRINGIFY(s) #s
#define STRINGIFY_TMP(A) STRINGIFY(A)
#define CONCAT(A, B) A##B

//reference for spiffs upload https://taillieu.info/index.php/internet-of-things/esp8266/335-esp8266-uploading-files-to-the-server

//#define INVERTED_SERIAL // Comment this out for non-inverted serial


#ifndef WIFI_AP_SSID
#define WIFI_AP_SSID "ExpressLRS AP"
#endif
#ifndef WIFI_AP_PSK
#define WIFI_AP_PSK "expresslrs"
#endif

#ifndef WIFI_TIMEOUT
#define WIFI_TIMEOUT 60 // default to 1min
#endif

#if !ESP_NOW
#define WIFI_CHANNEL 0 // Not defined
#if defined(ESP_NOW_CHANNEL)
#undef ESP_NOW_CHANNEL
#endif
#define ESP_NOW_CHANNEL 1

#else // ESP_NOW
#define WIFI_CHANNEL 2
#ifndef ESP_NOW_CHANNEL
#define ESP_NOW_CHANNEL 1
#endif
#if (ESP_NOW_CHANNEL == WIFI_CHANNEL)
#error "WiFi Channel config error! ESPNOW and WiFi must be on different channels"
#endif
#endif // ESP_NOW

MDNSResponder mdns;

ESP8266WebServer server(80);

WebSocketsServer webSocket = WebSocketsServer(81);
ESP8266HTTPUpdateServer httpUpdater;

File fsUploadFile; // a File object to temporarily store the received file
String uploadedfilename; // filename of uploaded file

//uint8_t socketNumber;

String inputString = "";
String my_ipaddress_info_str = "NA";

#if ESP_NOW
String espnow_init_info = "";
#endif
String bootlog = "";

#if CONFIG_HANDSET
/* Handset specific data */
struct gimbal_limit gimbals[TX_NUM_ANALOGS];
struct mixer mixer[TX_NUM_MIXER];
static uint8_t handset_num_switches, handset_num_aux;
static uint8_t handset_mixer_ok = 0, handset_adjust_ok = 0;
#endif

static const char PROGMEM GO_BACK[] = R"rawliteral(
<!DOCTYPE html><html><head></head>
<body><script>javascript:history.back();</script></body>
</html>
)rawliteral";

static const char PROGMEM INDEX_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
<meta name="viewport" content="width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
<title>ExpressLRS</title>
<style>
body {
background-color: #1E1E1E;
font-family: Arial, Helvetica, Sans-Serif;
Color: #69cbf7;
}
</style>
</head><body onload="javascript:start();">
This is a backup page<br/>
Open <a href="/update">/update</a> and update filesystem also...<br/>
</body></html>
)rawliteral";

/*************************************************************************/

class CtrlSerialPrivate: public CtrlSerial
{
public:
  size_t available(void) {
    return Serial.available();
  }
  uint8_t read(void) {
    return Serial.read();
  }

  void write(uint8_t * buffer, size_t size) {
    Serial.write(buffer, size);
  }
};

CtrlSerialPrivate my_ctrl_serial;
CtrlSerial& ctrl_serial = my_ctrl_serial;

static uint8_t settings_rate;
static uint8_t settings_power, settings_power_max;
static uint8_t settings_tlm;
static uint8_t settings_region;
static uint8_t settings_valid;
String settings_out;

MSP msp_handler;
mspPacket_t msp_out;

void SettingsWrite(uint8_t * buff, uint8_t len)
{
  // Fill MSP packet
  msp_out.type = MSP_PACKET_V1_ELRS;
  msp_out.flags = MSP_ELRS_INT;
  msp_out.payloadSize = len;
  msp_out.function = ELRS_INT_MSP_PARAMS;
  memcpy((void*)msp_out.payload, buff, len);
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

void handleSettingRate(const char * input, int num = -1)
{
  settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_rates_input=";
    settings_out += settings_rate;
  } else if (*input == '=') {
    input++;
    settings_out = "Setting rate: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    uint8_t buff[] = {1, (uint8_t)(val == 'R' ? 0xff : (val - '0'))};
    SettingsWrite(buff, sizeof(buff));
  }
  if (0 <= num)
    webSocket.sendTXT(num, settings_out);
  else
    webSocket.broadcastTXT(settings_out);
}

void handleSettingPower(const char * input, int num = -1)
{
  settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_power_input=";
    settings_out += settings_power;
    settings_out += ",";
    settings_out += settings_power_max;
  } else if (*input == '=') {
    input++;
    settings_out = "Setting power: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    uint8_t buff[] = {3, (uint8_t)(val == 'R' ? 0xff : (val - '0'))};
    SettingsWrite(buff, sizeof(buff));
  }
  if (0 <= num)
    webSocket.sendTXT(num, settings_out);
  else
    webSocket.broadcastTXT(settings_out);
}

void handleSettingTlm(const char * input, int num = -1)
{
  settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_tlm_input=";
    settings_out += settings_tlm;
  } else if (*input == '=') {
    input++;
    settings_out = "Setting telemetry: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    uint8_t buff[] = {2, (uint8_t)(val == 'R' ? 0xff : (val - '0'))};
    SettingsWrite(buff, sizeof(buff));
  }
  if (0 <= num)
    webSocket.sendTXT(num, settings_out);
  else
    webSocket.broadcastTXT(settings_out);
}

void handleSettingRfPwr(const char * input, int num = -1)
{
  settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    return;
  } else if (*input == '=') {
    input++;
    settings_out = "Setting RF PWR: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    if ('A' <= val)
      val = 10 + (val - 'A');
    else
      val = (val - '0');
    uint8_t buff[] = {6, (uint8_t)val};
    SettingsWrite(buff, sizeof(buff));
  }
  if (0 <= num)
    webSocket.sendTXT(num, settings_out);
  else
    webSocket.broadcastTXT(settings_out);
}

void handleSettingRfModule(const char * input, int num = -1)
{
  settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    return;
  } else if (*input == '=') {
    input++;
    settings_out = "Setting RF module: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    if ('A' <= val)
      val = 10 + (val - 'A');
    else
      val = (val - '0');
    uint8_t buff[] = {4, (uint8_t)val};
    SettingsWrite(buff, sizeof(buff));
  }
  if (0 <= num)
    webSocket.sendTXT(num, settings_out);
  else
    webSocket.broadcastTXT(settings_out);
}

void handleSettingDomain(const char * input, int num = -1)
{
  settings_out = "[ERROR] Domain set is not supported!";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_region_domain=";
    settings_out += settings_region;
  }
  if (0 <= num)
    webSocket.sendTXT(num, settings_out);
  else
    webSocket.broadcastTXT(settings_out);
}

void SettingsGet(uint8_t wsnum)
{
  if (!settings_valid) {
    /* Unknown... reguest update */
    uint8_t buff[] = {0, 0};
    SettingsWrite(buff, sizeof(buff));
  } else {
    /* Valid, just send those to client */
    delay(5);
    handleSettingDomain(NULL, wsnum);
    delay(5);
    handleSettingRate(NULL, wsnum);
    delay(5);
    handleSettingPower(NULL, wsnum);
    delay(5);
    handleSettingTlm(NULL, wsnum);
  }
}

void MspVtxWrite(const char * input, int num = -1)
{
  (void)num;
  (void)input;
  //uint8_t power = 1;
  uint16_t freq = 5840; //(uint16_t)msg[0] * 8 + msg[1]; // band * 8 + channel

  if (input[0] == '=') {
    freq = (input[1] - '0');
    freq = freq*10 + (input[2] - '0');
    freq = freq*10 + (input[3] - '0');
    freq = freq*10 + (input[4] - '0');
  }

  uint8_t vtx_cmd[] = {
    (uint8_t)freq, (uint8_t)(freq >> 8),
    //power,
    //(power == 0), // pit mode
  };

