kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
  // Fill MSP packet
  msp_out.reset();
  msp_out.type = MSP_PACKET_V1_CMD;
  msp_out.flags = MSP_VERSION | MSP_STARTFLAG;
  msp_out.function = MSP_VTX_SET_CONFIG;
  msp_out.payloadSize = sizeof(vtx_cmd);
  memcpy((void*)msp_out.payload, vtx_cmd, sizeof(vtx_cmd));
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

#if CONFIG_HANDSET
uint8_t char_to_dec(uint8_t const chr)
{
  if ('0' <= chr && chr <= '9') {
    return chr - '0';
  }
  return 0;
}

uint8_t char_to_hex(uint8_t chr)
{
  if ('A' <= chr && chr <= 'F')
    return (10 + (chr - 'A'));
  if ('a' <= chr && chr <= 'f')
    return (10 + (chr - 'a'));
  return char_to_dec(chr);
}

uint8_t char_u8_to_hex(const char * chr)
{
  uint8_t val = char_to_hex(*chr++);
  val <<= 4;
  val += char_to_hex(*chr++);
  return val;
}

uint8_t char_u8_to_dec(const char * chr)
{
  uint8_t val = char_to_dec(*chr++) * 10;
  val += char_to_dec(*chr++);
  return val;
}

uint16_t char_u12_to_hex(const char * chr)
{
  uint16_t val = char_to_hex(*chr++);
  val <<= 4;
  val += char_to_hex(*chr++);
  val <<= 4;
  val += char_to_hex(*chr++);
  return val;
}

void handleHandsetCalibrate(const char * input)
{
  uint8_t value = 0;
  // Fill MSP packet
  msp_out.reset();

  value = char_to_hex(input[3]);
  if (value == 1)
    value = GIMBAL_CALIB_LOW;
  else if (value == 2)
    value = GIMBAL_CALIB_MID;
  else if (value == 3)
    value = GIMBAL_CALIB_HIGH;

  if (!strncmp(input, "L1_", 3)) {
    value |= (GIMBAL_CALIB_L_V);
  } else if (!strncmp(input, "L2_", 3)) {
    value |= (GIMBAL_CALIB_L_H);
  } else if (!strncmp(input, "R1_", 3)) {
    value |= (GIMBAL_CALIB_R_V);
  } else if (!strncmp(input, "R2_", 3)) {
    value |= (GIMBAL_CALIB_R_H);
  }

  if (!value)
    return;

  msp_out.type = MSP_PACKET_V1_ELRS;
  msp_out.flags = MSP_ELRS_INT;
  msp_out.function = ELRS_HANDSET_CALIBRATE;
  msp_out.addByte(value);
  msp_out.addByte(1); // Start
  msp_out.setIteratorToSize();
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

void handleHandsetCalibrateResp(uint8_t * data, int num = -1)
{
  String out = "ELRS_handset_calibrate=ERROR!";
  if (0 <= num)
    webSocket.sendTXT(num, out);
  else
    webSocket.broadcastTXT(out);
}


void handleHandsetMixer(const char * input, size_t length)
{
  //webSocket.broadcastTXT(input, length);
  uint32_t iter, index, scale;
  const char * read = input;
  // Fill MSP packet
  msp_out.reset();
  msp_out.type = MSP_PACKET_V1_ELRS;
  msp_out.flags = MSP_ELRS_INT;
  msp_out.function = ELRS_HANDSET_MIXER;
  for (iter = 0; iter < ARRAY_SIZE(mixer) && ((size_t)(read - input) < length); iter++) {
    // channel index
    index = char_to_hex(*read++);
    msp_out.addByte(index);
    // channel out
    msp_out.addByte(char_to_hex(*read++));
    // inverted
    msp_out.addByte(char_to_hex(*read++));
    // Scale
    if (index < 4) {
      scale = char_u8_to_dec(read);
      msp_out.addByte(scale);

      String temp = "Gimbal: ";
      temp += index;
      temp += " Scale: ";
      temp += scale;
      webSocket.broadcastTXT(temp);

      read += 2;
    }
  }
  msp_out.setIteratorToSize();
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

void handleHandsetMixerResp(uint8_t * data, int num = -1)
{
  String out = "ELRS_handset_mixer=";
  uint8_t iter;
  if (data) {
    for (iter = 0; iter < ARRAY_SIZE(mixer); iter++) {
      if (data[0] < ARRAY_SIZE(mixer)) {
        mixer[data[0]] = (struct mixer){
          .index=data[1], .inv=data[2], .scale=data[3]};
      }
      data += 4;
    }
    handset_num_switches = *data++;
    handset_num_aux = *data++;
  }

  out += handset_num_aux;
  out += ";";
  out += handset_num_switches;
  out += ";";

  for (iter = 0; iter < ARRAY_SIZE(mixer); iter++) {
    if (iter)
      out += ',';
    out += iter;
    out += ":";
    out += mixer[iter].index;
    out += ":";
    out += mixer[iter].inv;
    out += ":";
    out += mixer[iter].scale;
  }

  if (0 <= num)
    webSocket.sendTXT(num, out);
  else
    webSocket.broadcastTXT(out);
}


void handleHandsetAdjust(const char * input)
{
  const char * temp;
  uint16_t value;
  // Fill MSP packet
  msp_out.reset();
  msp_out.type = MSP_PACKET_V1_ELRS;
  msp_out.flags = MSP_ELRS_INT;

  if (strncmp(&input[3], "min", 3) == 0)
    msp_out.function = ELRS_HANDSET_ADJUST_MIN;
  else if (strncmp(&input[3], "mid", 3) == 0)
    msp_out.function = ELRS_HANDSET_ADJUST_MID;
  else if (strncmp(&input[3], "max", 3) == 0)
    msp_out.function = ELRS_HANDSET_ADJUST_MAX;
  else
    /* not valid cmd */
    return;

  if (!strncmp(input, "L1_", 3))
    msp_out.payload[0] = GIMBAL_IDX_L1;
  else if (!strncmp(input, "L2_", 3))
    msp_out.payload[0] = GIMBAL_IDX_L2;
  else if (!strncmp(input, "R1_", 3))
    msp_out.payload[0] = GIMBAL_IDX_R1;
  else if (!strncmp(input, "R2_", 3))
    msp_out.payload[0] = GIMBAL_IDX_R2;
  else
    /* not valid cmd */
    return;

  temp = strstr((char*)input, "=");
  value = char_u12_to_hex(&temp[1]);
  msp_out.payload[1] = (uint8_t)(value >> 8);
  msp_out.payload[2] = (uint8_t)value;
  // Send packet
  msp_out.payloadSize = 3;
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

void handleHandsetAdjustResp(uint8_t * data, int num = -1)
{
  String out = "ELRS_handset_adjust=";
  uint8_t iter;
  if (data) {
    memcpy(gimbals, data, sizeof(gimbals));
  }

  for (iter = 0; iter < ARRAY_SIZE(gimbals); iter++) {
    struct gimbal_limit * limits = &gimbals[iter];
    out += limits->low;
    out += ":";
    out += limits->mid;
    out += ":";
    out += limits->high;
    out += ";";
  }

  if (0 <= num)
    webSocket.sendTXT(num, out);
  else
    webSocket.broadcastTXT(out);
}

void HandsetConfigGet(uint8_t wsnum, uint8_t force=0)
{
  if (!handset_mixer_ok || !handset_adjust_ok || force) {
    // Fill MSP packet
    msp_out.reset();
    msp_out.type = MSP_PACKET_V1_ELRS;
    msp_out.flags = MSP_ELRS_INT;
    msp_out.function = ELRS_HANDSET_CONFIGS_LOAD;
    msp_out.payload[0] = 1;
    msp_out.payload[1] = 1;
    msp_out.payloadSize = 2;
    // Send packet
    MSP::sendPacket(&msp_out, &my_ctrl_serial);
    return;
  }

