kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
  delay(5);
  handleHandsetMixerResp(NULL, wsnum);
  delay(5);
  handleHandsetAdjustResp(NULL, wsnum);
}

void HandsetConfigSave(uint8_t wsnum)
{
  // Fill MSP packet
  msp_out.reset();
  msp_out.type = MSP_PACKET_V1_ELRS;
  msp_out.flags = MSP_ELRS_INT;
  msp_out.function = ELRS_HANDSET_CONFIGS_SAVE;
  msp_out.payload[0] = 1;
  msp_out.payload[1] = 1;
  msp_out.payloadSize = 2;
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

#endif // CONFIG_HANDSET

#ifdef BUZZER_PIN
void beep(int note, int duration, int wait=1)
{
  tone(BUZZER_PIN, note, duration);
  if (wait)
    delay(duration);
}
#else
#define beep(N, T, W)
#endif

#if CONFIG_HANDSET

#define ADC_R1  100000U  //100k ohm
#define ADC_R2  10000U   //10k ohm
//#define ADC_VOLT(X) (((X) * ADC_R2) / (ADC_R1 + ADC_R2))
#define ADC_SCALE (ADC_R1 / ADC_R2)

#define ADC_REF_mV  (1075U * ADC_SCALE)
#define ADC_MAX     1023U
#define ADC_VOLT(X) (((uint32_t)(X) * ADC_REF_mV) / ADC_MAX)

static uint32_t batt_voltage;
static uint32_t batt_voltage_scale = 100;
static uint32_t batt_voltage_interval = 5000;
static uint32_t batt_voltage_warning = 75;
static uint32_t batt_voltage_warning_limit = ((75 * 4200) / 100);

static uint32_t last_batt_meas;

void battery_voltage_report(int num = -1)
{
  String out = "ELRS_handset_battery=";
  out += batt_voltage;
  out += ",";
  out += batt_voltage_scale;
  out += ",";
  out += batt_voltage_warning;

  if (0 <= num)
    webSocket.sendTXT(num, out);
  else
    webSocket.broadcastTXT(out);
}

void battery_voltage_parse(const char * input, int num = -1)
{
  const char * temp = strstr(input, ",");
  uint32_t scale = char_u8_to_hex(input);
  if (50 <= scale && scale <= 150) {
    batt_voltage_scale = scale;
  }
  if (temp) {
    scale = char_u8_to_hex(&temp[1]);
    if (10 <= scale && scale <= 100) {
      batt_voltage_warning = scale;
      batt_voltage_warning_limit = ((scale * 4200) / 100);
    }
  }
}

void measure_batt_voltage(void)
{
  uint32_t ms = millis();
  if (batt_voltage_interval <= (uint32_t)(ms - last_batt_meas)) {
    int adc = analogRead(A0);
    batt_voltage = ADC_VOLT(adc);
    batt_voltage = (batt_voltage * batt_voltage_scale) / 100;

    battery_voltage_report();

    if (batt_voltage <= batt_voltage_warning_limit) {
      // 400Hz, 100ms
      beep(400, 100, 0);
    }
    last_batt_meas = ms;

    /*
    String temp = "Battery: ";
    temp += adc;
    temp += " >> ";
    temp += batt_voltage;
    webSocket.broadcastTXT(temp);
    */
  }
}

#else
#define measure_batt_voltage()
#endif

void webSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length)
{
  char * temp;
  //Serial.printf("webSocketEvent(%d, %d, ...)\r\n", num, type);

  switch (type)
  {
  case WStype_DISCONNECTED:
    //Serial.printf("[%u] Disconnected!\r\n", num);
    break;
  case WStype_CONNECTED:
  {
    //IPAddress ip = webSocket.remoteIP(num);
    //Serial.printf("[%u] Connected from %d.%d.%d.%d url: %s\r\n", num, ip[0], ip[1], ip[2], ip[3], payload);
    //socketNumber = num;

    webSocket.sendTXT(num, my_ipaddress_info_str);
#if ESP_NOW
    webSocket.sendTXT(num, espnow_init_info);
#endif

    // Send settings
    SettingsGet(num);
#if CONFIG_HANDSET
    HandsetConfigGet(num);
    delay(5);
    battery_voltage_report(num);
#endif
  }
  break;
  case WStype_TEXT:
    //Serial.printf("[%u] get Text: %s\r\n", num, payload);
    // send data to all connected clients
    //webSocket.broadcastTXT(payload, length);

    temp = strstr((char*)payload, "stm32_cmd=");
    if (temp) {
      // Command STM32
      if (strstr((char*)&temp[10], "reset")) {
        // Reset STM32
        reset_stm32_to_app_mode();
      }
    } else {

#if CONFIG_HANDSET
      /* Handset specific */
      temp = strstr((char*)payload, "handset_");
      if (temp) {

        // handset_mixer=
        temp = strstr((char*)payload, "mixer=");
        if (temp) {
          temp = &temp[6];
          handleHandsetMixer(temp, (length - ((uintptr_t)temp - (uintptr_t)payload)));
          break;
        }

        // handset_calibrate=
        temp = strstr((char*)payload, "calibrate=");
        if (temp) {
          handleHandsetCalibrate(&temp[10]);
          break;
        }

        // handset_adjust_[axe]_[min|max]=val
        temp = strstr((char*)payload, "_adjust_");
        if (temp) {
          handleHandsetAdjust(&temp[8]);
          break;
        }

        temp = strstr((char*)payload, "_refresh");
        if (temp) {
          HandsetConfigGet(num, 1);
          break;
        }

        temp = strstr((char*)payload, "_save");
        if (temp) {
          HandsetConfigSave(num);
          break;
        }

        temp = strstr((char*)payload, "_battery_config=");
        if (temp) {
          battery_voltage_parse(&temp[16], num);
          break;
        }
      } else
#endif // CONFIG_HANDSET

      {
        // ExLRS setting commands
        temp = strstr((char*)payload, "S_rate");
        if (temp) {
          handleSettingRate(&temp[6], num);
          break;
        }
        temp = strstr((char*)payload, "S_power");
        if (temp) {
          handleSettingPower(&temp[7], num);
          break;
        }
        temp = strstr((char*)payload, "S_telemetry");
        if (temp) {
          handleSettingTlm(&temp[11], num);
          break;
        }
        temp = strstr((char*)payload, "S_vtx_freq");
        if (temp) {
          MspVtxWrite(&temp[10], num);
          break;
        }
        temp = strstr((char*)payload, "S_rf_pwr");
        if (temp) {
          handleSettingRfPwr(&temp[8], num);
          break;
        }
        temp = strstr((char*)payload, "S_rf_module");
        if (temp) {
          handleSettingRfModule(&temp[11], num);
          break;
        }
      }
    }
    break;
  case WStype_BIN:
    //Serial.printf("[%u] get binary length: %u\r\n", num, length);
    hexdump(payload, length);

    // echo data back to browser
    webSocket.sendBIN(num, payload, length);
    break;
  default:
    //Serial.printf("Invalid WStype [%d]\r\n", type);
    //webSocket.broadcastTXT("Invalid WStype: " + type);
    break;
  }
}

