kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
/***********************************************************************************/
/*************                   STM32 OTA UPGRADE                     *************/

int8_t flash_stm32(uint32_t flash_addr)
{
  int8_t result = -1;
  webSocket.broadcastTXT("STM32 Firmware Flash Requested!");
  webSocket.broadcastTXT("  the firmware file: '" + uploadedfilename + "'");
  if (uploadedfilename.endsWith("firmware.elrs")) {
    result = stk500_write_file(uploadedfilename.c_str());
  } else if (uploadedfilename.endsWith("firmware.bin")) {
    result = esp8266_spifs_write_file(uploadedfilename.c_str(), flash_addr);
    if (result == 0)
      reset_stm32_to_app_mode(); // boot into app
  } else {
    webSocket.broadcastTXT("Invalid file!");
  }
  Serial.begin(SERIAL_BAUD);
  return result;
}

void handleFileUploadEnd()
{
  uint32_t flash_base = BEGIN_ADDRESS;
  //String message = "\nRequest params:\n";
  for (uint8_t i = 0; i < server.args(); i++) {
    String name = server.argName(i);
    String value = server.arg(i);
      //message += " " + name + ": " + value + "\n";
      if (name == "flash_address") {
        flash_base = strtol(&value.c_str()[2], NULL, 16);
        break;
      }
  }
  //webSocket.broadcastTXT(message);

  int8_t success = flash_stm32(flash_base);

  if (uploadedfilename.length() && FILESYSTEM.exists(uploadedfilename))
    FILESYSTEM.remove(uploadedfilename);

  server.sendHeader("Location", "/return");          // Redirect the client to the success page
  server.send(303);
  webSocket.broadcastTXT(
    (success) ? "Update Successful!": "Update Failure!");
  server.send((success < 0) ? 400 : 200);
}

void handleFileUpload()
{ // upload a new file to the SPIFFS
  HTTPUpload &upload = server.upload();
  if (upload.status == UPLOAD_FILE_START)
  {
    /* Remove old file */
    if (uploadedfilename.length() && FILESYSTEM.exists(uploadedfilename))
      FILESYSTEM.remove(uploadedfilename);

    FSInfo fs_info;
    if (FILESYSTEM.info(fs_info))
    {
      Dir dir = FILESYSTEM.openDir("/");
      while (dir.next()) {
        String file = dir.fileName();
        if (file.endsWith(".bin")) {
          FILESYSTEM.remove(file);
        }
      }

      String output = "Filesystem: used: ";
      output += fs_info.usedBytes;
      output += " / free: ";
      output += fs_info.totalBytes;
      webSocket.broadcastTXT(output);

      if (fs_info.usedBytes > 0) {
        //webSocket.broadcastTXT("formatting filesystem");
        //FILESYSTEM.format();
      }
    }
    else
    {
      webSocket.broadcastTXT("SPIFFs Failed to init!");
      return;
    }
    uploadedfilename = upload.filename;

    webSocket.broadcastTXT("Uploading file: " + uploadedfilename);

    if (!uploadedfilename.startsWith("/"))
    {
      uploadedfilename = "/" + uploadedfilename;
    }
    fsUploadFile = FILESYSTEM.open(uploadedfilename, "w"); // Open the file for writing in SPIFFS (create if it doesn't exist)
  }
  else if (upload.status == UPLOAD_FILE_WRITE)
  {
    if (fsUploadFile)
    {
      fsUploadFile.write(upload.buf, upload.currentSize); // Write the received bytes to the file
      String output = "Uploaded: ";
      output += fsUploadFile.position();
      output += " bytes";
      webSocket.broadcastTXT(output);
    }
  }
  else if (upload.status == UPLOAD_FILE_END)
  {
    if (fsUploadFile)
    {                       // If the file was successfully created
      String totsize = "Total uploaded size ";
      totsize += fsUploadFile.position();
      totsize += " of ";
      totsize += upload.totalSize;
      webSocket.broadcastTXT(totsize);
      server.send(100);
      fsUploadFile.close(); // Close the file again
    }
    else
    {
      server.send(500, "text/plain", "500: couldn't create file");
    }
  }
}

/***********************************************************************************/
/*************                    ESP OTA UPGRADE                      *************/
#define LOCAL_OTA 0
#if LOCAL_OTA
void handle_upgrade_error(void)
{
  server.sendHeader("Location", "/return");          // Redirect the client to the success page
  server.send(303);
  webSocket.broadcastTXT(
    (Update.hasError()) ? "Update Failure!" : "Update Successful!");
  server.send(Update.hasError() ? 200 : 400);
}

void handleEspUpgrade(void)
{
  HTTPUpload& upload = server.upload();
  if (upload.status == UPLOAD_FILE_START) {
    //Serial.setDebugOutput(true);
    WiFiUDP::stopAll();
    //Serial.printf("Update: %s\n", upload.filename.c_str());
    webSocket.broadcastTXT("*** ESP OTA ***\n  file: " + upload.filename);

    /*if (upload.name != "backpack_fw") {
      webSocket.broadcastTXT("Invalid upload type!");
      return;
    } else*/ if (!upload.filename.startsWith("backpack.bin")) {
      webSocket.broadcastTXT("Invalid file! Update aborted...");
      handle_upgrade_error();
      return;
    }

    uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
    if (!Update.begin(maxSketchSpace, U_FLASH)) { //start with max available size
      //Update.printError(Serial);
      webSocket.broadcastTXT("File is too big!");
      handle_upgrade_error();
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      //Update.printError(Serial);
      webSocket.broadcastTXT("Junk write failed!");
      handle_upgrade_error();
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (Update.end(true)) { //true to set the size to the current progress
      //Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
      webSocket.broadcastTXT("Update Success! Rebooting...");
    } else {
      //Update.printError(Serial);
      webSocket.broadcastTXT("Update failed!");
    }
    //Serial.setDebugOutput(false);
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    Update.end();
  }
  delay(0); //same as yield();
}

void handleEspUpgradeFinalize(void)
{
  server.sendHeader("Location", "/return");          // Redirect the client to the success page
  server.send(303);
  webSocket.broadcastTXT(
    (Update.hasError()) ? "Update Failure!" : "Update Successful!");
  server.send(Update.hasError() ? 200 : 400);
  //server.sendHeader("Connection", "close");
  //server.send(200, "text/plain", (Update.hasError()) ? "FAIL" : "OK");
  ESP.restart();
}
#endif // LOCAL_OTA

